#+TITLE: Land of Lisp
#+AUTHOR: Vlad Tutunea
#+STARTUP: overview

** Handling Data in a Generic Way
=sequence functions= work generally across the three main ways of sequencing objects in Lisp: lists, arrays and string.
=length=
search sequences: =find-if=, =count=, =position=, =some= and =every=
sequence function for iterating across a sequence: =reduce=
#+begin_src lisp
(reduce #'+ '(3 4 6 5 2) :initial-value 10 :start 3)
#+end_src

Exercise: find the largest even number in the list: =(7 4 6 5 2)= -> =6=
#+begin_src lisp
(reduce (lambda (best item)
		  (if (and (evenp item) (> item best))
			  item
			  best))
		'(7 4 6 5 2)
		:initial-value 0)
#+end_src

The =map= function works on all sequence types, not just lists.
#+begin_src lisp
(map 'string
	 (lambda (x)
	   (if (eq x #\s)
		   #\S
		   x))
	 "this is a string")
#+end_src

#+RESULTS:
: thiS iS a String

=subseq=
#+begin_src lisp
(subseq "america" 2 6)
#+end_src
=sort=
#+begin_src lisp
(defparameter *my-list* '(8 2 3 7 2 1))
(sort *my-list* #'<)
*my-list*
#+end_src

*** Creating Generic Functions with Type Predicates
Dynamically typed language !!
#+begin_src lisp
(symbolp 6)
#+end_src

#+begin_src lisp
(defun add (a b)
  (cond ((and (numberp a) (numberp b)) (+ a b))
		((and (listp a) (listp b)) (append a b))))

(add 3 4)
(add '(a b) '(c d))
#+end_src

=defmethod= let us define multiple versions of a function that each supports different types.
#+begin_src lisp
(defmethod add2 ((a number) (b number))
  (+ a b))

(defmethod add2 ((a list) (b list))
  (append a b))

(add 3 8)
(add '(a b) '(c d))
#+end_src

#+RESULTS:
| A | B | C | D |

